Keyrim/drone-stm32f1/Anciennes Versions/flight_controller_v2.3/lib/bsp/tft_ili9341/stm32f1_ili9341.c
/**	
 * |----------------------------------------------------------------------
 * | Copyright (C) Tilen Majerle, 2014
 * | 
 * | This program is free software: you can redistribute it and/or modify
 * | it under the terms of the GNU General Public License as published by
 * | the Free Software Foundation, either version 3 of the License, or
 * | any later version.
 * |  
 * | This program is distributed in the hope that it will be useful,
 * | but WITHOUT ANY WARRANTY; without even the implied warranty of
 * | MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * | GNU General Public License for more details.
 * | 
 * | You should have received a copy of the GNU General Public License
 * | along with this program.  If not, see <http://www.gnu.org/licenses/>.
 * |----------------------------------------------------------------------
 */

#include "config.h"
#include <stdarg.h>
#if USE_SCREEN_TFT_ILI9341
#include "stm32f1_ili9341.h"
#include "stm32f1xx_hal.h"
#include "stm32f1_spi.h"
#include "macro_types.h"
#include "stm32f1_gpio.h"
/*
 * This library contains the functions needed to use the ILI9341 TFT screen with an STM32F1.
 *
 * The module uses the SPI bus and the pins are imposed (fitting power supply and GND must have been chosen aswell):
 *
 *  CS   : PA12 : Chip select for SPI
 *  RESET: PA9  : Pin used to reset the screen
 *  D/C  : PA8  : Pin used to select Data or Command
 *  SDI  : PA7  : Input from SPI master (MOSI)
 *  SCK  : PA5  : SPI Clock
 *  LED  : +3,3V:
 *  SDO  : PA6  : Output from screen to SPI (MISO)
 *
 *  How to use this library:
 *
 *  - Make sure the USE_SCREEN_TFT_ILI9341 in config.h is correctly defined at 1
 *  - Initialise the library (init function)
 *  - Use the wanted function to draw on the screen
 *
 */


/* Pin definitions */
#define ILI9341_RST_SET()			HAL_GPIO_WritePin(ILI9341_RST_PORT,ILI9341_RST_PIN, 1)
#define ILI9341_RST_RESET()			HAL_GPIO_WritePin(ILI9341_RST_PORT,ILI9341_RST_PIN, 0)
#define ILI9341_CS_SET()			HAL_GPIO_WritePin(ILI9341_CS_PORT, ILI9341_CS_PIN, 1)
#define ILI9341_CS_RESET()			HAL_GPIO_WritePin(ILI9341_CS_PORT, ILI9341_CS_PIN, 0)
#define ILI9341_WRX_SET()			HAL_GPIO_WritePin(ILI9341_WRX_PORT, ILI9341_WRX_PIN, 1)
#define ILI9341_WRX_RESET()			HAL_GPIO_WritePin(ILI9341_WRX_PORT, ILI9341_WRX_PIN, 0)

/* Private defines */
#define ILI9341_RESET				0x01
#define ILI9341_SLEEP_OUT			0x11
#define ILI9341_GAMMA				0x26
#define ILI9341_DISPLAY_OFF			0x28
#define ILI9341_DISPLAY_ON			0x29
#define ILI9341_COLUMN_ADDR			0x2A
#define ILI9341_PAGE_ADDR			0x2B
#define ILI9341_GRAM				0x2C
#define ILI9341_CMD_MEMORY_READ		0x2E
#define ILI9341_MAC					0x36
#define ILI9341_PIXEL_FORMAT		0x3A
#define ILI9341_WDB					0x51
#define ILI9341_WCD					0x53
#define ILI9341_RGB_INTERFACE		0xB0
#define ILI9341_FRC					0xB1
#define ILI9341_BPC					0xB5
#define ILI9341_DFC					0xB6
#define ILI9341_POWER1				0xC0
#define ILI9341_POWER2				0xC1
#define ILI9341_VCOM1				0xC5
#define ILI9341_VCOM2				0xC7
#define ILI9341_POWERA				0xCB
#define ILI9341_POWERB				0xCF
#define ILI9341_PGAMMA				0xE0
#define ILI9341_NGAMMA				0xE1
#define ILI9341_DTCA				0xE8
#define ILI9341_DTCB				0xEA
#define ILI9341_POWER_SEQ			0xED
#define ILI9341_3GAMMA_EN			0xF2
#define ILI9341_INTERFACE			0xF6
#define ILI9341_PRC					0xF7

/* Pin functions */
uint16_t ILI9341_x;
uint16_t ILI9341_y;
ILI931_Options_t ILI9341_Opts;
uint8_t ILI9341_INT_CalledFromPuts = 0;

/* Private functions */
void ILI9341_InitLCD(void);
void ILI9341_SendData(uint8_t data);
void ILI9341_ReadDatas(uint8_t command_to_write, uint8_t * datas, uint8_t nb_to_read);
void ILI9341_SendCommand(uint8_t data);
void ILI9341_Delay(volatile unsigned int delay);
void ILI9341_SetCursorPosition(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2);
void ILI9341_INT_Fill(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t color);


/*
 * Cette fonction à pour but de vous aider à appréhender les fonctionnalités de ce module logiciel.
 * Cette fonction n'est pas blocante et doit être appelée une fois dans l'init.
 */
void ILI9341_demo(void)
{
	ILI9341_Init();
	ILI9341_Rotate(ILI9341_Orientation_Landscape_2);
//	ILI9341_DisplayOff();
//	ILI9341_DisplayOn();
	ILI9341_Fill(ILI9341_COLOR_WHITE);
	ILI9341_DrawCircle(20,20,5,ILI9341_COLOR_BLUE);
	ILI9341_DrawLine(20,20,100,20,ILI9341_COLOR_RED);
	ILI9341_DrawLine(20,20,20,100,ILI9341_COLOR_RED);

	#if USE_FONT7x10
		ILI9341_Putc(110,11,'x',&Font_7x10,ILI9341_COLOR_BLUE,ILI9341_COLOR_WHITE);
		ILI9341_Putc(15,110,'y',&Font_7x10,ILI9341_COLOR_BLUE,ILI9341_COLOR_WHITE);
		ILI9341_Puts(25,200, "chaine 7x10", &Font_7x10, ILI9341_COLOR_BROWN, ILI9341_COLOR_WHITE);
	#endif
	#if USE_FONT11x18
		ILI9341_Puts(25,225, "chaine 11x18", &Font_11x18, ILI9341_COLOR_BROWN, ILI9341_COLOR_WHITE);
	#endif
	#if USE_FONT16x26
		ILI9341_Puts(25,250, "chaine 16x26", &Font_16x26, ILI9341_COLOR_BROWN, ILI9341_COLOR_WHITE);
	#endif
}
/**
 * @brief  Initializes ILI9341 LCD with LTDC peripheral
 *         It also initializes external SDRAM
 * @param  None
 * @retval None
 */
void ILI9341_Init(void)
{
	/* Init WRX pin */
	BSP_GPIO_PinCfg(ILI9341_WRX_PORT,ILI9341_WRX_PIN, GPIO_MODE_OUTPUT_PP,GPIO_NOPULL,GPIO_SPEED_FREQ_MEDIUM);
	
	/* Init CS pin */
	BSP_GPIO_PinCfg(ILI9341_CS_PORT,ILI9341_CS_PIN, GPIO_MODE_OUTPUT_PP,GPIO_NOPULL,GPIO_SPEED_FREQ_MEDIUM);
	
	/* Init RST pin */
	BSP_GPIO_PinCfg(ILI9341_RST_PORT,ILI9341_RST_PIN, GPIO_MODE_OUTPUT_PP,GPIO_PULLUP,GPIO_SPEED_FREQ_LOW);


	/* CS high */
	ILI9341_CS_SET();
	
	/* Init SPI */
	SPI_Init(ILI9341_SPI);
	
	/* Init DMA for SPI */
	//SPI_DMA_Init(ILI9341_SPI);
	
	/* Init LCD */
	ILI9341_InitLCD();
	
	/* Set default settings */
	ILI9341_x = ILI9341_y = 0;
	ILI9341_Rotate(ILI9341_Orientation_Portrait_1);
	//ILI9341_Rotate(ILI9341_Orientation_Landscape_1);	//Utiliser cette fonction pour modifier l'orientation en paysage
	
	/* Fill with white color */
	ILI9341_Fill(ILI9341_COLOR_WHITE);
}

/**
 * @brief init function for XPT2046 lib
 */
void ILI9341_setConfig(void){
	SPI_setBaudRate(ILI9341_SPI, SPI_BAUDRATEPRESCALER_2);
}


/**
 * @brief  Initializes ILI9341 LCD
 * @param  None
 * @retval None
 */
void ILI9341_InitLCD(void) {
	/* Force reset */
	ILI9341_RST_RESET();
	HAL_Delay(20);
	ILI9341_RST_SET();
	
