Keyrim/drone-stm32f1/Anciennes Versions/flight_controller_v2.3/lib/bsp/tft_ili9341/stm32f1_ili9341.c
	/* Delay for RST response */
	HAL_Delay(20);
	
	/* Software reset */
	ILI9341_SendCommand(ILI9341_RESET);
	HAL_Delay(50);
	
	// Power control A
	ILI9341_SendCommand(ILI9341_POWERA);
	ILI9341_SendData(0x39);
	ILI9341_SendData(0x2C);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0x34);
	ILI9341_SendData(0x02);

	// Power control B
	ILI9341_SendCommand(ILI9341_POWERB);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0xC1);
	ILI9341_SendData(0x30);

	// Driver timing control A
	ILI9341_SendCommand(ILI9341_DTCA);
	ILI9341_SendData(0x85);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0x78);

	// Driver timing control B
	ILI9341_SendCommand(ILI9341_DTCB);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0x00);

	// Power on sequence control
	ILI9341_SendCommand(ILI9341_POWER_SEQ);
	ILI9341_SendData(0x64);
	ILI9341_SendData(0x03);
	ILI9341_SendData(0x12);
	ILI9341_SendData(0x81);

	// Pump ratio control
	ILI9341_SendCommand(ILI9341_PRC);
	ILI9341_SendData(0x20);

	// Power control 1
	ILI9341_SendCommand(ILI9341_POWER1);
	ILI9341_SendData(0x23);

	// Power control 2
	ILI9341_SendCommand(ILI9341_POWER2);
	ILI9341_SendData(0x10);

	// VCOM control 1
	ILI9341_SendCommand(ILI9341_VCOM1);
	ILI9341_SendData(0x3E);
	ILI9341_SendData(0x28);

	// VCOM control 2
	ILI9341_SendCommand(ILI9341_VCOM2);
	ILI9341_SendData(0x86);

	// Memory access control
	ILI9341_SendCommand(ILI9341_MAC);
	ILI9341_SendData(0x48);

	// Pixel format set
	ILI9341_SendCommand(ILI9341_PIXEL_FORMAT);
	ILI9341_SendData(0x55);

	// Frame rate control
	ILI9341_SendCommand(ILI9341_FRC);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0x18);

	// Display function control
	ILI9341_SendCommand(ILI9341_DFC);
	ILI9341_SendData(0x08);
	ILI9341_SendData(0x82);
	ILI9341_SendData(0x27);

	// 3Gamma function disable
	ILI9341_SendCommand(ILI9341_3GAMMA_EN);
	ILI9341_SendData(0x00);


	ILI9341_SendCommand(ILI9341_COLUMN_ADDR);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0xEF);

	ILI9341_SendCommand(ILI9341_PAGE_ADDR);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0x01);
	ILI9341_SendData(0x3F);

	// Gamma curve selected
	ILI9341_SendCommand(ILI9341_GAMMA);
	ILI9341_SendData(0x01);

	// Set positive gamma
	ILI9341_SendCommand(ILI9341_PGAMMA);
	ILI9341_SendData(0x0F);
	ILI9341_SendData(0x31);
	ILI9341_SendData(0x2B);
	ILI9341_SendData(0x0C);
	ILI9341_SendData(0x0E);
	ILI9341_SendData(0x08);
	ILI9341_SendData(0x4E);
	ILI9341_SendData(0xF1);
	ILI9341_SendData(0x37);
	ILI9341_SendData(0x07);
	ILI9341_SendData(0x10);
	ILI9341_SendData(0x03);
	ILI9341_SendData(0x0E);
	ILI9341_SendData(0x09);
	ILI9341_SendData(0x00);

	// Set negative gama
	ILI9341_SendCommand(ILI9341_NGAMMA);
	ILI9341_SendData(0x00);
	ILI9341_SendData(0x0E);
	ILI9341_SendData(0x14);
	ILI9341_SendData(0x03);
	ILI9341_SendData(0x11);
	ILI9341_SendData(0x07);
	ILI9341_SendData(0x31);
	ILI9341_SendData(0xC1);
	ILI9341_SendData(0x48);
	ILI9341_SendData(0x08);
	ILI9341_SendData(0x0F);
	ILI9341_SendData(0x0C);
	ILI9341_SendData(0x31);
	ILI9341_SendData(0x36);
	ILI9341_SendData(0x0F);

	ILI9341_SendCommand(ILI9341_SLEEP_OUT);

	HAL_Delay(10);

	ILI9341_SendCommand(ILI9341_DISPLAY_ON);
	ILI9341_SendCommand(ILI9341_GRAM);
}

/**
 * @brief   Enables display
 * @note    After initialization, LCD is enabled and you don't need to call this function
 * @param   None
 * @retval  None
 */
void ILI9341_DisplayOn(void) {
	ILI9341_SendCommand(ILI9341_DISPLAY_ON);
}

/**
 * @brief   Disables display
 * @param   None
 * @retval  None
 */
void ILI9341_DisplayOff(void) {
	ILI9341_SendCommand(ILI9341_DISPLAY_OFF);
}

/**
 * @brief  Sends chosen Command to the SPI bus
 * @param  None
 * @retval None
 */
void ILI9341_SendCommand(uint8_t data) {
	ILI9341_WRX_RESET();
	ILI9341_CS_RESET();
	SPI_WriteNoRegister(ILI9341_SPI,data);
	ILI9341_CS_SET();
}





/**
 * @brief  Sends chosen Data to the SPI bus
 * @param  None
 * @retval None
 */
void ILI9341_SendData(uint8_t data) {
	//TODO Isnt that redundant
	ILI9341_WRX_SET();
	ILI9341_CS_RESET();
	SPI_WriteNoRegister(ILI9341_SPI, data);
	ILI9341_CS_SET();
}

void ILI9341_ReadDatas(uint8_t command_to_write, uint8_t * datas, uint8_t nb_to_read) {
	ILI9341_CS_RESET();
	ILI9341_WRX_RESET();
	SPI_WriteNoRegister(ILI9341_SPI, command_to_write);
	ILI9341_WRX_SET();
	SPI_ReadMultiNoRegister(ILI9341_SPI, datas, nb_to_read);
	ILI9341_CS_SET();
}

/**
 * @brief  Draws single pixel to LCD
 * @param  x: X position for pixel
 * @param  y: Y position for pixel
 * @param  color: Color of pixel
 * @retval None
 */
void ILI9341_DrawPixel(uint16_t x, uint16_t y, uint16_t color) {
	ILI9341_SetCursorPosition(x, y, x, y);

	ILI9341_SendCommand(ILI9341_GRAM);
	ILI9341_SendData(color >> 8);
	ILI9341_SendData(color & 0xFF);
}

uint16_t ILI9341_ReadPixel(int16_t x, int16_t y)
{
    uint8_t block[400] = {0};
    ILI9341_SetCursorPosition(x, y, x, y);
    ILI9341_ReadDatas(ILI9341_CMD_MEMORY_READ, block, 400);
    return ((block[1] & 0xF8) << 8u) | ((block[2] & 0xFC) << 3u) | (block[3] >> 3u);
}

/**
 * @brief  Used to select an area where the cursor will draw a color on the screen
 * @param  x1: X coordinate of top left corner of area
 * @param  y1: Y coordinate of top left corner of area
 * @param  x2: X coordinate of bottom right of area
 * @param  y2: Y coordinate of bottom right of area
 * @retval None
 */
void ILI9341_SetCursorPosition(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2) {
	ILI9341_SendCommand(ILI9341_COLUMN_ADDR);
	ILI9341_SendData(x1 >> 8);
	ILI9341_SendData(x1 & 0xFF);
	ILI9341_SendData(x2 >> 8);
	ILI9341_SendData(x2 & 0xFF);

	ILI9341_SendCommand(ILI9341_PAGE_ADDR);
	ILI9341_SendData(y1 >> 8);
	ILI9341_SendData(y1 & 0xFF);
	ILI9341_SendData(y2 >> 8);
	ILI9341_SendData(y2 & 0xFF);
}

/**
 * @brief  Fills entire LCD with color
 * @param  color: Color to be used in fill
 * @retval None
 */
void ILI9341_Fill(uint16_t color) {
	/* Fill entire screen */
	ILI9341_INT_Fill(0, 0, ILI9341_Opts.width - 1, ILI9341_Opts.height, color);
}

/**
 * @brief  Fills chosen area with a color
 * @param  x0: X coordinate of top left point
 * @param  y0: Y coordinate of top left point
 * @param  x1: X coordinate of bottom right point
 * @param  y1: Y coordinate of bottom right point
 * @param  color: Color to be used in fill
 * @retval None
 */
void ILI9341_INT_Fill(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t color) {
	uint32_t pixels_count;
	uint8_t datas[2];
	datas[1] = HIGHINT(color);
	datas[0] = LOWINT(color);

	/* Set cursor position */
	ILI9341_SetCursorPosition(x0, y0, x1, y1);

	/* Set command for GRAM data */
	ILI9341_SendCommand(ILI9341_GRAM);
	
	/* Calculate pixels count */
	pixels_count = (x1 - x0 + 1) * (y1 - y0 + 1);

	/* Send everything */
	ILI9341_CS_RESET();
	ILI9341_WRX_SET();
	
	/* Go to 16-bit SPI mode */
	TM_SPI_SetDataSize(ILI9341_SPI, TM_SPI_DataSize_16b);
	
