Keyrim/drone-stm32f1/Anciennes Versions/flight_controller_v2.3/lib/bsp/tft_ili9341/stm32f1_ili9341.c
	/* Send first 65535 bytes, SPI MUST BE IN 16-bit MODE */
	//SPI_DMA_SendHalfWord(ILI9341_SPI, color, (pixels_count > 0xFFFF) ? 0xFFFF : pixels_count);
	uint32_t i;
	for(i=0;i<pixels_count;i++)
		SPI_WriteMultiNoRegister(ILI9341_SPI, datas, 1);

	/* Wait till done */
	//while (SPI_DMA_Working(ILI9341_SPI));
	
	/* Check again */
	//if (pixels_count > 0xFFFF) {
		/* Send remaining data */
		//SPI_DMA_SendHalfWord(ILI9341_SPI, color, pixels_count - 0xFFFF);
		/* Wait till done */
		//while (SPI_DMA_Working(ILI9341_SPI));
	//}
	
	ILI9341_CS_SET();

	/* Go back to 8-bit SPI mode */
	TM_SPI_SetDataSize(ILI9341_SPI, TM_SPI_DataSize_8b);
}

void ILI9341_Delay(volatile unsigned int delay) {
	for (; delay != 0; delay--); 
}

/**
 * @brief  Rotates LCD to specific orientation
 * @param  orientation: LCD orientation. This parameter can be a value of @ref ILI9341_Orientation_t enumeration
 * @retval None
 */
void ILI9341_Rotate(ILI9341_Orientation_t orientation) {
	ILI9341_SendCommand(ILI9341_MAC);
	if (orientation == ILI9341_Orientation_Portrait_1) {
		ILI9341_SendData(0x58);
	} else if (orientation == ILI9341_Orientation_Portrait_2) {
		ILI9341_SendData(0x88);
	} else if (orientation == ILI9341_Orientation_Landscape_1) {
		ILI9341_SendData(0x28);
	} else if (orientation == ILI9341_Orientation_Landscape_2) {
		ILI9341_SendData(0xE8);
	}
	ILI9341_Opts.orientation = orientation;
	if (orientation == ILI9341_Orientation_Portrait_1 || orientation == ILI9341_Orientation_Portrait_2) {
		ILI9341_Opts.width = ILI9341_WIDTH;
		ILI9341_Opts.height = ILI9341_HEIGHT;
	} else {
		ILI9341_Opts.width = ILI9341_HEIGHT;
		ILI9341_Opts.height = ILI9341_WIDTH;
	}
}

/**
 * @brief  Puts string to LCD
 * @param  x: X position of top left corner of first character in string
 * @param  y: Y position of top left corner of first character in string
 * @param  *str: Pointer to first character
 * @param  *font: Pointer to @ref FontDef_t used font
 * @param  foreground: Color for string
 * @param  background: Color for string background
 * @retval None
 */
void ILI9341_Puts(uint16_t x, uint16_t y, char *str, FontDef_t *font, uint16_t foreground, uint16_t background) {
	uint16_t startX = x;
	
	/* Set X and Y coordinates */
	ILI9341_x = x;
	ILI9341_y = y;
	
	while (*str) {
		/* New line */
		if (*str == '\n') {
			ILI9341_y += font->FontHeight + 1;
			/* if after \n is also \r, than go to the left of the screen */
			if (*(str + 1) == '\r') {
				ILI9341_x = 0;
				str++;
			} else {
				ILI9341_x = startX;
			}
			str++;
			continue;
		} else if (*str == '\r') {
			str++;
			continue;
		}
		if(ILI9341_x > ILI9341_Opts.width - font->FontWidth)
		{  
			//on passe à la ligne suivante, en s'alignant sous le début de la première ligne
			ILI9341_y += font->FontHeight + 1;
			ILI9341_x = startX;
		}
		/* Put character to LCD */
		ILI9341_Putc(ILI9341_x, ILI9341_y, *str++, font, foreground, background);
	}
}

/*
 *	permet l'affichage de "gros caractères" ('bigger' fois plus gros que la 'font' fournie)
 *	full_in_bigger défini le taux de remplissage des gros pixels générés. Testez pour comprendre et apprécier le style !
 *	@pre : full_in_bigger doit être inférieur ou égal à bigger.
 *	exemples :
 *		ILI9341_PutBigs(20, 40, "tst4,3",&Font_16x26, ILI9341_COLOR_BLUE,ILI9341_COLOR_BLACK, 4, 3);
 *	 	ILI9341_PutBigs(20, 40, "test2,2",&Font_16x26, ILI9341_COLOR_BLUE,ILI9341_COLOR_BLACK, 2, 2);
 */
void ILI9341_PutBigs(uint16_t x, uint16_t y, char *str, FontDef_t *font, uint16_t foreground, uint16_t background, uint8_t bigger, uint8_t full_in_bigger) {
	uint16_t startX = x;

	/* Set X and Y coordinates */
	ILI9341_x = x;
	ILI9341_y = y;

	while (*str) {
		/* New line */
		if (*str == '\n') {
			ILI9341_y += font->FontHeight*bigger + bigger;
			/* if after \n is also \r, than go to the left of the screen */
			if (*(str + 1) == '\r') {
				ILI9341_x = 0;
				str++;
			} else {
				ILI9341_x = startX;
			}
			str++;
			continue;
		} else if (*str == '\r') {
			str++;
			continue;
		}
		if(ILI9341_x > ILI9341_Opts.width - font->FontWidth*bigger)
		{
			//on passe à la ligne suivante, en s'alignant sous le début de la première ligne
			ILI9341_y += font->FontHeight*bigger + bigger;
			ILI9341_x = startX;
		}
		/* Put character to LCD */
		ILI9341_PutBigc(ILI9341_x, ILI9341_y, *str++, font, foreground, background, bigger, full_in_bigger);
	}
}

/**
 * @brief  Gets width and height of box with text
 * @param  *str: Pointer to first character
 * @param  *font: Pointer to @ref FontDef_t used font
 * @param  *width: Pointer to variable to store width
 * @param  *height: Pointer to variable to store height
 * @retval None
 */
void ILI9341_GetStringSize(char *str, FontDef_t *font, uint16_t *width, uint16_t *height) {
	uint16_t w = 0;
	*height = font->FontHeight;
	while (*str++) {
		w += font->FontWidth;
	}
	*width = w;
}

/**
 * @brief  Puts single character to LCD
 * @param  x: X position of top left corner
 * @param  y: Y position of top left corner
 * @param  c: Character to be displayed
 * @param  *font: Pointer to @ref FontDef_t used font
 * @param  foreground: Color for char
 * @param  background: Color for char background
 * @retval None
 */
void ILI9341_Putc(uint16_t x, uint16_t y, char c, FontDef_t *font, uint16_t foreground, uint16_t background) {
	uint32_t i, b, j;
	/* Set coordinates */
	ILI9341_x = x;
	ILI9341_y = y;
	
	if ((ILI9341_x + font->FontWidth) > ILI9341_Opts.width) {
		/* If at the end of a line of display, go to new line and set x to 0 position */
		ILI9341_y += font->FontHeight;
		ILI9341_x = 0;
	}
	
	/* Draw rectangle for background */
	ILI9341_INT_Fill(ILI9341_x, ILI9341_y, ILI9341_x + font->FontWidth, ILI9341_y + font->FontHeight, background);
	

	/* Draw font data */
	for (i = 0; i < font->FontHeight; i++) {


		if(font->datasize == 1)
		{
			uint8_t * data;
			data = (uint8_t *)font->data;
			b = (uint32_t)(data[(c - 32) * font->FontHeight + i]) << 8;
		}
		else if(font->datasize == 2)
		{
			uint16_t * data;
			data = (uint16_t *)font->data;
			b = data[(c - 32) * font->FontHeight + i];
		}
		else
			b = 0;	//should never happen
		for (j = 0; j < font->FontWidth; j++) {
			if ((b << j) & 0x8000) {
				ILI9341_DrawPixel(ILI9341_x + j, (ILI9341_y + i), foreground);
			}
		}
	}
	
	/* Set new pointer */
	ILI9341_x += font->FontWidth;
}


