Keyrim/drone-stm32f1/Anciennes Versions/flight_controller_v2.3/lib/bsp/tft_ili9341/stm32f1_ili9341.c
    while (x < y) {
        if (f >= 0) {
            y--;
            ddF_y += 2;
            f += ddF_y;
        }
        x++;
        ddF_x += 2;
        f += ddF_x;

        ILI9341_DrawLine(x0 - x, y0 + y, x0 + x, y0 + y, color);
        ILI9341_DrawLine(x0 + x, y0 - y, x0 - x, y0 - y, color);

        ILI9341_DrawLine(x0 + y, y0 + x, x0 - y, y0 + x, color);
        ILI9341_DrawLine(x0 + y, y0 - x, x0 - y, y0 - x, color);
    }
}

/**
 * @brief  Returns ILI9341 options
 * @retval ILI9341_Opts : options
 */

ILI931_Options_t ILI9341_getOptions(void){
	return ILI9341_Opts;
}

/**
 * @brief  Puts formated string to LCD
 * @param  x: X position of top left corner of first character in string
 * @param  y: Y position of top left corner of first character in string
 * @param  *font: Pointer to @ref FontDef_t used font
 * @param  foreground: Color for string
 * @param  background: Color for string background
 * @param  format : Formated string like printf
 * @retval None
 */
void ILI9341_printf(int16_t x, int16_t y, FontDef_t *font, int16_t foreground, int16_t background, const char *format, ...)
{
	char buffer[256];

	va_list args_list;
	va_start(args_list, format);
	vsnprintf(buffer, 256, format, args_list);
	va_end(args_list);

	ILI9341_Puts(x, y, buffer, font, foreground, background);
}

/**
 * @brief  Put Image on LCD
 * @param  x0: X coordinate of starting point
 * @param  y0: Y coordinate of starting point
 * @param  width: width of image
 * @param  height: height of image
 * @param  img: Pointeur sur le tableau des pixels de l'image en BMP 565
 * @param  size: Nombre d'élément dans le tableau
 * @retval None
 */
void ILI9341_putImage(int16_t x0, int16_t y0, int16_t width, int16_t height, const int16_t *img, int32_t size){
	ILI9341_SetCursorPosition(x0, y0, x0 + width-1, y0 + height-1);

	uint8_t datas[2];

	/* Set command for GRAM data */
	ILI9341_SendCommand(ILI9341_GRAM);

	/* Send everything */
	ILI9341_CS_RESET();
	ILI9341_WRX_SET();

	/* Go to 16-bit SPI mode */
	TM_SPI_SetDataSize(ILI9341_SPI, TM_SPI_DataSize_16b);

#ifndef LCD_DMA
	int32_t i;
	for(i=0; i < size; i++){
		datas[1] = HIGHINT(img[i]);
		datas[0] = LOWINT(img[i]);
		SPI_WriteMultiNoRegister(ILI9341_SPI, datas, 1);
		//SPI_WriteNoRegister(ILI9341_SPI,0x07E0);
		//SPI_Write(img[i]);
	}
#else
	SPI2_DMA_send16BitArray((Uint16 *)img, size);
#endif


	TM_SPI_SetDataSize(ILI9341_SPI, TM_SPI_DataSize_8b);
}

#ifndef LCD_DMA
//size : nombre de pixel (1 pixel = 1 bit !)
//img : tableau contenant une image en monochrome, 1 octet = 8 pixels ! (bit de poids fort = premier pixel)
//    tout bit à 1 est du blanc. tout bit à 0 est du noir.
//La taille (width et height) doit être multiple de 8 !
void ILI9341_putImage_monochrome(uint16_t color_front, uint16_t color_background, int16_t x0, int16_t y0, int16_t width, int16_t height, const uint8_t *img, int32_t size)
{
	ILI9341_SetCursorPosition(x0, y0, x0 + width-1, y0 + height-1);

	uint8_t datas_front[2];
	uint8_t datas_background[2];
	datas_front[1] = HIGHINT(color_front);
	datas_front[0] = LOWINT(color_front);
	datas_background[1] = HIGHINT(color_background);
	datas_background[0] = LOWINT(color_background);
	uint8_t * datas;
	/* Set command for GRAM data */
	ILI9341_SendCommand(ILI9341_GRAM);

	/* Send everything */
	ILI9341_CS_RESET();
	ILI9341_WRX_SET();

	/* Go to 16-bit SPI mode */
	TM_SPI_SetDataSize(ILI9341_SPI, TM_SPI_DataSize_16b);


	int32_t i;
	for(i=0; i < size; i++){
		if((img[i/8]>>(7-i%8))&1)	//Hooo, la belle ligne. Prenez 5mn pour comprendre ce qui est fait ici ^^
			datas = datas_background;
		else
			datas = datas_front;

		SPI_WriteMultiNoRegister(ILI9341_SPI, datas, 1);
	}


	TM_SPI_SetDataSize(ILI9341_SPI, TM_SPI_DataSize_8b);
}
#endif	//ndef LCD_DMA

#endif
